Revit 2027 API
Document.ProjectInformation Property
Return the Project Information of the current project.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ProjectInfo ProjectInformation { get; }
Public ReadOnly Property ProjectInformation As ProjectInfo
	Get
public:
property ProjectInfo^ ProjectInformation {
	ProjectInfo^ get ();
}
member ProjectInformation : ProjectInfo with get
Return Value
ProjectInfo
Autodesk::Revit::DB::ProjectInfo
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace